Revit 2026 API

# Plane Class

---

A Planar surface.

SystemObject Autodesk.Revit.DBSurface Autodesk.Revit.DBPlane

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Plane : Surface
```
```vb
Public Class Plane
	Inherits Surface
```
```cpp
public ref class Plane : public Surface
```
```fsharp
type Plane =
    class
        inherit Surface
    end
```

The Plane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from Surface) |
|  | Normal | Plane normal. |
|  | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from Surface) |
|  | Origin | Plane origin. |
|  | XVec | Axis defining the first parametric direction of the plane. |
|  | YVec | Axis defining the second parametric direction of the plane. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Plane object defined by a local frame of reference. |
|  | CreateByNormalAndOrigin | Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily. |
|  | CreateByOriginAndBasis | Creates a Plane object defined by the two orthogonal unit vectors and passing through the origin point supplied as arguments. |
|  | CreateByThreePoints | Creates a Plane object passing through three points supplied as arguments. |
|  | Dispose | (Inherited from Surface) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from Surface) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from Surface) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The parametric equation of the plane is S(u, v) = origin + u*xVec + v*yVec.

#### Reference

Autodesk.Revit.DB Namespace